KingAbad/PEM_AutonomousCart/Autonomous_Cart_2-master/RFID_Project_PSoC4/RFID_Reader_PSOC.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "SPI.h"
#include "SPI_PVT.h"
#include "MISO.h"
#include "MISO_aliases.h"
#include "MOSI.h"
#include "MOSI_aliases.h"
#include "SCK.h"
#include "SCK_aliases.h"
#include "SDA.h"
#include "SDA_aliases.h"
#include "GREEN.h"
#include "GREEN_aliases.h"
#include "I2C.h"
#include "I2C_I2C.h"
#include "I2C_PINS.h"
#include "I2C_I2C_PVT.h"
#include "I2C_PVT.h"
#include "I2C_BOOT.h"
#include "RESET.h"
#include "RESET_aliases.h"
#include "Clock_2.h"
#include "PWM_1.h"
#include "BUZZERGROUND.h"
#include "BUZZERGROUND_aliases.h"
#include "BUZZER.h"
#include "BUZZER_aliases.h"
#include "Clock_1.h"
#include "RED.h"
#include "RED_aliases.h"
#include "PWM_2.h"
#include "SPI_IntClock.h"
#include "I2C_SCBCLK.h"
#include "I2C_sda.h"
#include "I2C_sda_aliases.h"
#include "I2C_scl.h"
#include "I2C_scl_aliases.h"
#include "I2C_SCB_IRQ.h"
#include "cy_em_eeprom.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyLFClk.h"

/*[]*/

